[
    { 
        "desc": "This poem snippet is from 'The Road Not Taken' by Robert Frost.",
        "text": "Two roads diverged in a yellow wood,\nAnd sorry I could not travel both\nAnd be one traveler, long I stood\nAnd looked down one as far as I could\nTo where it bent in the undergrowth;",
        "isAI": false
    },
    {
        "desc": "This poem was generated by ChatGPT.",
        "text": "Beneath the sky, so vast and wide,\nThe moonlight dances, gentle tide.\nWhispers soft on winds that roam,\nCarrying dreams to call them home.",
        "isAI": true
    },
    {
        "desc": "This review was generated by Gemini, guess it didn't like the coffee",
        "text": "Decent, but nothing extraordinary\nThe atmosphere in Brew Haven is cozy, with soft lighting and comfy seating. The baristas are friendly, but the coffee itself is just average. I had a caramel latte, which tasted fine but wasn't anything special. The flavor was slightly too sweet, and the coffee didn't have the boldness I expected.",
        "isAI": true
    },
    {
        "desc": "This review was from a real person (and not Chatgpt pretending to sound like a human)",
        "text": "Great atmosphere, meh latte\nLove the vibe at Brew Haven! The staff is friendly, but the caramel latte was too sweet for my taste. Black coffee was better, though. Their almond croissant, however, was amazing. I'll be back for the treats!",
        "isAI": false
    },
    {
        "desc": "This snippet is from a famous book by Herman Melville called Moby-Dick",
        "text": "Call me Ishmael. Some years ago—never mind how long precisely—having little or no money in my purse, and nothing particular to interest me on shore, I thought I would sail about a little and see the watery part of the world.",
        "isAI": false
    },
    {
        "desc": "This short passage was entirely generated by ChatGPT",
        "text": "He knelt and ran his fingers over the cracked pavement, feeling the weight of time settled within the fractures. Perhaps, he thought, the world had never belonged to them at all—it had simply waited, patient and unyielding, for their inevitable disappearance.",
        "isAI": true
    },
    {
        "desc": "This caption was generated by AI, no one posts like that.",
        "text": "Wanderlust unlocked! ✈️ Exploring the hidden gems of this breathtaking destination, where history meets modern charm. Every street has a story, and every sunset feels like a masterpiece. 🌍✨ #TravelDiaries #AdventureAwaits",
        "isAI": true
    },
    {
        "desc": "This caption is from an actual post",
        "text": "Finally made it to Bali! 🌴 First stop: beachside coconut and chasing the sunset. Can't believe this is real life. 🌊🌅 #BaliVibes #LivingMyBestLife",
        "isAI": false
    },
    {
        "desc": "This snippet is a modern AI-generated poem",
        "text": "In circuits and codes, dreams are spun, Where digital shadows chase the sun. Amid silicon whispers and binary light, A new era awakens in the heart of the night.",
        "isAI": true
    },
    {
        "desc": "This poem is 'Fire and Ice' by Robert Frost",
        "text": "Some say the world will end in fire,Some say in ice.\nFrom what I’ve tasted of desire I hold with those who favor fire.\nBut if it had to perish twice,I think I know enough of hate\nTo say that for destruction ice Is also great\nAnd would suffice.",
        "isAI": false
    },
    {
        "desc": "This restaurant review was generated by AI, although some rich people do talk like this",
        "text": "The ambiance of The Gilded Fork is exquisite, marrying modern design with classic charm. However, while the presentation dazzles, the flavors fall short of expectations, leaving a lingering sense of unfulfilled promise.",
        "isAI": true
      },
      {
        "desc": "A famous excerpt from '1984' by George Orwell.",
        "text": "It was a bright cold day in April, and the clocks were striking thirteen. Winston Smith, his chin nuzzled into his breast, slipped quickly through the glass doors of Victory Mansions.",
        "isAI": false
      },
      {
        "desc": "A short literary passage generated by AI with a dystopian tone.",
        "text": "In the echo of a silent metropolis, neon dreams flicker against the void, where whispers of lost freedoms collide with the cold hum of machinery.",
        "isAI": true
      },
      {
        "desc": "This is a genuine social media caption from a real travel enthusiast.",
        "text": "Just returned from an incredible trip to Iceland! Every moment was breathtaking, from the rugged landscapes to the soothing hot springs. Can't wait to share more!",
        "isAI": false
      },
      {
        "desc": "An AI-generated travel description that invites exploration.",
        "text": "Venture beyond the familiar, where ancient ruins and vibrant cultures converge in a tapestry of timeless allure. Let every step be a chapter in your own epic tale.",
        "isAI": true
      }
]